press/press/doctype/invoice/fixtures/stripe_payment_intent_succeeded_webhook.json

{
	"api_version": "2020-03-02",
	"cmd": "press.press.doctype.stripe_webhook_log.stripe_webhook_log.stripe_webhook_handler",
	"created": 1606748869,
	"data": {
		"object": {
			"amount": 90000,
			"amount_capturable": 0,
			"amount_received": 90000,
			"application": null,
			"application_fee_amount": null,
			"canceled_at": null,
			"cancellation_reason": null,
			"capture_method": "automatic",
			"charges": {
				"data": [
					{
						"amount": 90000,
						"amount_captured": 90000,
						"amount_refunded": 0,
						"application": null,
						"application_fee": null,
						"application_fee_amount": null,
						"balance_transaction": "txn_1HtDyjGjnxV0XKmrzExVjDUA",
						"billing_details": {
							"address": {
								"city": null,
								"country": null,
								"line1": null,
								"line2": null,
								"postal_code": null,
								"state": null
							},
							"email": null,
							"name": null,
							"phone": null
						},
						"calculated_statement_descriptor": "Stripe",
						"captured": true,
						"created": 1606748869,
						"currency": "inr",
						"customer": "cus_H3L4w6RXJPKLQs",
						"description": null,
						"destination": null,
						"dispute": null,
						"disputed": false,
						"failure_code": null,
						"failure_message": null,
						"fraud_details": {},
						"id": "ch_1HtDyjGjnxV0XKmrM13MbJf2",
						"invoice": null,
						"livemode": false,
					  "metadata": {
						  "gst": "144.36",
						  "payment_for": "prepaid_credits"
					  },
						"object": "charge",
						"on_behalf_of": null,
						"order": null,
						"outcome": {
							"network_status": "approved_by_network",
							"reason": null,
							"risk_level": "normal",
							"risk_score": 59,
							"seller_message": "Payment complete.",
							"type": "authorized"
						},
						"paid": true,
						"payment_intent": "pi_1HtDybGjnxV0XKmrq0F7ktU2",
						"payment_method": "pm_1HtDyiGjnxV0XKmrj2LbRgZs",
						"payment_method_details": {
							"card": {
								"brand": "visa",
								"checks": {
									"address_line1_check": null,
									"address_postal_code_check": null,
									"cvc_check": "pass"
								},
								"country": "US",
								"exp_month": 2,
								"exp_year": 2022,
								"fingerprint": "rbydJcL7HczjZDc9",
								"funding": "credit",
								"installments": null,
								"last4": "4242",
								"network": "visa",
								"three_d_secure": null,
								"wallet": null
							},
							"type": "card"
						},
						"receipt_email": null,
						"receipt_number": null,
						"receipt_url": "https://pay.stripe.com/receipts/acct_1GSLsTGjnxV0XKmr/ch_1HtDyjGjnxV0XKmrM13MbJf2/rcpt_IUCNHB5rR5pULHIsx4A73o50XriQTEw",
						"refunded": false,
						"refunds": {
							"data": [],
							"has_more": false,
							"object": "list",
							"total_count": 0,
							"url": "/v1/charges/ch_1HtDyjGjnxV0XKmrM13MbJf2/refunds"
						},
						"review": null,
						"shipping": null,
						"source": null,
						"source_transfer": null,
						"statement_descriptor": null,
						"statement_descriptor_suffix": null,
						"status": "succeeded",
						"transfer_data": null,
						"transfer_group": null
					}
				],
				"has_more": false,
				"object": "list",
				"total_count": 1,
				"url": "/v1/charges?payment_intent=pi_1HtDybGjnxV0XKmrq0F7ktU2"
			},
			"client_secret": "pi_1HtDybGjnxV0XKmrq0F7ktU2_secret_zS2HILsiJlMa1SdWcrTWzfZgl",
			"confirmation_method": "automatic",
			"created": 1606748861,
			"currency": "inr",
			"customer": "cus_H3L4w6RXJPKLQs",
			"description": null,
			"id": "pi_1HtDybGjnxV0XKmrq0F7ktU2",
			"invoice": null,
			"last_payment_error": null,
			"livemode": false,
			"metadata": {
				"gst": "144.36",
				"payment_for": "prepaid_credits"
			},
			"next_action": null,
			"object": "payment_intent",
			"on_behalf_of": null,
			"payment_method": "pm_1HtDyiGjnxV0XKmrj2LbRgZs",
			"payment_method_options": {
				"card": {
					"installments": null,
					"network": null,
					"request_three_d_secure": "automatic"
				}
			},
			"payment_method_types": ["card"],
			"receipt_email": null,
			"review": null,
			"setup_future_usage": null,
			"shipping": null,
			"source": null,
			"statement_descriptor": null,
			"statement_descriptor_suffix": null,
			"status": "succeeded",
			"transfer_data": null,
			"transfer_group": null
		}
	},
	"id": "evt_1HtDykGjnxV0XKmrfG08iI3Z",
	"livemode": false,
	"object": "event",
	"pending_webhooks": 2,
	"request": {
		"id": "req_Vw5ippANYMNBSZ",
		"idempotency_key": null
	},
	"type": "payment_intent.succeeded"
}
